Examenes resueltos/Bloque 3/p2/web/WEB-INF/wsdl/localhost_8080/p1ServerSOAP/calculaComparaFechas.wsdl

<?xml version='1.0' encoding='UTF-8'?><!-- Published by JAX-WS RI (http://jax-ws.java.net). RI's version is Metro/2.3.2-b608 (trunk-7979; 2015-01-21T12:50:19+0000) JAXWS-RI/2.2.11-b150120.1832 JAXWS-API/2.2.12 JAXB-RI/2.2.12-b141219.1637 JAXB-API/2.2.13-b141020.1521 svn-revision#unknown. --><!-- Generated by JAX-WS RI (http://jax-ws.java.net). RI's version is Metro/2.3.2-b608 (trunk-7979; 2015-01-21T12:50:19+0000) JAXWS-RI/2.2.11-b150120.1832 JAXWS-API/2.2.12 JAXB-RI/2.2.12-b141219.1637 JAXB-API/2.2.13-b141020.1521 svn-revision#unknown. --><definitions xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:wsp="http://www.w3.org/ns/ws-policy" xmlns:wsp1_2="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:tns="http://webServiceSOAP/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="http://schemas.xmlsoap.org/wsdl/" targetNamespace="http://webServiceSOAP/" name="calculaComparaFechas">
<types>
<xsd:schema>
<xsd:import namespace="http://webServiceSOAP/" schemaLocation="http://localhost:8080/p1ServerSOAP/calculaComparaFechas?xsd=1"/>
</xsd:schema>
</types>
<message name="calculaComparaFecha">
<part name="parameters" element="tns:calculaComparaFecha"/>
</message>
<message name="calculaComparaFechaResponse">
<part name="parameters" element="tns:calculaComparaFechaResponse"/>
</message>
<message name="ParseException">
<part name="fault" element="tns:ParseException"/>
</message>
<portType name="calculaComparaFechas">
<operation name="calculaComparaFecha">
<input wsam:Action="http://webServiceSOAP/calculaComparaFechas/calculaComparaFechaRequest" message="tns:calculaComparaFecha"/>
<output wsam:Action="http://webServiceSOAP/calculaComparaFechas/calculaComparaFechaResponse" message="tns:calculaComparaFechaResponse"/>
<fault message="tns:ParseException" name="ParseException" wsam:Action="http://webServiceSOAP/calculaComparaFechas/calculaComparaFecha/Fault/ParseException"/>
</operation>
</portType>
<binding name="calculaComparaFechasPortBinding" type="tns:calculaComparaFechas">
<soap:binding transport="http://schemas.xmlsoap.org/soap/http" style="document"/>
<operation name="calculaComparaFecha">
<soap:operation soapAction=""/>
<input>
<soap:body use="literal"/>
</input>
<output>
<soap:body use="literal"/>
</output>
<fault name="ParseException">
<soap:fault name="ParseException" use="literal"/>
</fault>
</operation>
</binding>
<service name="calculaComparaFechas">
<port name="calculaComparaFechasPort" binding="tns:calculaComparaFechasPortBinding">
<soap:address location="http://localhost:8080/p1ServerSOAP/calculaComparaFechas"/>
</port>
</service>
</definitions>